currency-converter-service/internal/soap/testdata/soap-convert-valid.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cur="http://example.com/currencyconverter">
  <soapenv:Body>
    <cur:ConvertAmountRequest>
      <Amount>100</Amount>
      <FromCurrency>USD</FromCurrency>
      <ToCurrency>CHF</ToCurrency>
    </cur:ConvertAmountRequest>
  </soapenv:Body>
</soapenv:Envelope>
