CurrencyConverterService/internal/soap/testdata/soap-get-rate-valid.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cur="http://example.com/currencyconverter">
  <soapenv:Body>
    <cur:GetExchangeRateRequest>
      <FromCurrency>USD</FromCurrency>
      <ToCurrency>CHF</ToCurrency>
    </cur:GetExchangeRateRequest>
  </soapenv:Body>
</soapenv:Envelope>
