CurrencyConverterService/internal/soap/testdata/soap-unsupported-currency.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cur="http://example.com/currencyconverter">
  <soapenv:Body>
    <cur:GetExchangeRateRequest>
      <FromCurrency>AUD</FromCurrency>
      <ToCurrency>EUR</ToCurrency>
    </cur:GetExchangeRateRequest>
  </soapenv:Body>
</soapenv:Envelope>
