currency-converter-service/internal/soap/testdata/soap-missing-required-field.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cur="http://example.com/currencyconverter">
  <soapenv:Body>
    <cur:GetExchangeRateRequest>
      <FromCurrency>EUR</FromCurrency>
    </cur:GetExchangeRateRequest>
  </soapenv:Body>
</soapenv:Envelope>
